{
	"baseitem": [

    ],
	"itemProperty": [

    ],
	"itemType": [
        
    ],
	"itemEntry": [
		{
			"name": "Ring of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"You have resistance to {{item.resist}} damage while wearing this ring. The ring is set with {{item.detail1}}."
			]
		},
		{
			"name": "Armor of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"You have resistance to {{item.resist}} damage while you wear this armor."
			]
		},
		{
			"name": "Potion of Resistance",
			"source": "DMG",
			"entriesTemplate": [
				"When you drink this potion, you gain resistance to {{item.resist}} damage for 1 hour."
			]
		},
		{
			"name": "Absorbing Tattoo",
			"source": "TCE",
			"entriesTemplate": [
				"Produced by a special needle, this magic tattoo features designs that emphasize one color ({{item.detail1}}).",
				{
					"type": "entries",
					"name": "Tattoo Attunement",
					"entries": [
						"To attune to this item, you hold the needle to your skin where you want the tattoo to appear, pressing the needle there throughout the attunement process. When the attunement is complete, the needle turns into the ink that becomes the tattoo, which appears on the skin.",
						"If your attunement to the tattoo ends, the tattoo vanishes, and the needle reappears in your space."
					]
				},
				{
					"type": "entries",
					"name": "Damage Resistance",
					"entries": [
						"While the tattoo is on your skin, you have resistance to {{item.resist}} damage."
					]
				},
				{
					"type": "entries",
					"name": "Damage Absorption",
					"entries": [
						"When you take {{item.resist}} damage, you can use your reaction to gain immunity against that instance of the damage, and you regain a number of hit points equal to half the damage you would have taken. Once this reaction is used, it can't be used again until the next dawn."
					]
				}
			]
		},
		{
			"name": "Chromatic Rose",
			"source": "WBtW",
			"entriesTemplate": [
				"While this rose is held, it {{item.detail1}} as a harmless visual effect.",
				"While holding the rose by its stem, you gain resistance to {{item.resist}} damage. If you would take more than 10 {{item.resist}} damage from a single source (after applying the resistance), the rose disintegrates, and you take no damage instead.",
				"As an action, you can blow the petals from the rose to produce a 20-foot cone of {{item.resist}}. Each creature in the cone must make a DC 15 Constitution saving throw, taking {@damage 3d10} {{item.resist}} damage on a failed save, or half as much damage on a successful one. Using this property destroys the rose."
			]
		}
	],
	"itemTypeAdditionalEntries": [
        
    ]
}
